In [4]:
import pandas as pd

In [10]:
a=pd.Series([11,21,5,38,5])
a

0    11
1    21
2     5
3    38
4     5
dtype: int64

In [11]:
type(a)

pandas.core.series.Series

In [14]:
a={
    "roll no.":[1,2,3,4,5],
    "name of student":['rahul','mohit','dinesh','monu','rohit'],
    "grade":["a","b","c","a","b"]
}

In [15]:
type(a)

dict

In [16]:
df=pd.DataFrame(a)
df

   roll no. name of student grade
0         1           rahul     a
1         2           mohit     b
2         3          dinesh     c
3         4            monu     a
4         5           rohit     b

In [18]:
df.head()

   roll no. name of student grade
0         1           rahul     a
1         2           mohit     b
2         3          dinesh     c
3         4            monu     a
4         5           rohit     b

In [19]:
df.tail(2)

   roll no. name of student grade
3         4            monu     a
4         5           rohit     b

In [23]:
df.sample(2)

   roll no. name of student grade
4         5           rohit     b
3         4            monu     a

In [24]:
df.to_csv("C:\\Users\\ASUS\\OneDrive\\Desktop\\pandas\\imp.csv")

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("C:\\Users\\ASUS\\OneDrive\\Desktop\\pandas\\covid_toy.csv")

In [8]:
df.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [10]:
df.head(2)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes

In [11]:
df.tail()

    age  gender  fever   cough       city has_covid
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

In [12]:
df.sample(5)

    age  gender  fever   cough       city has_covid
52   47  Female  100.0  Strong  Bangalore       Yes
44   20    Male  102.0  Strong      Delhi        No
95   12  Female  104.0    Mild  Bangalore        No
85   16  Female  103.0    Mild  Bangalore       Yes
36   38  Female  101.0    Mild  Bangalore        No

In [17]:
df.describe()

              age       fever
count  100.000000   90.000000
mean    44.220000  100.844444
std     24.878931    2.054926
min      5.000000   98.000000
25%     20.000000   99.000000
50%     45.000000  101.000000
75%     66.500000  102.750000
max     84.000000  104.000000

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    int64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [21]:
top_left_corner_df = df.iloc[:5,  :4]
top_left_corner_df

   age  gender  fever cough
0   60    Male  103.0  Mild
1   27    Male  100.0  Mild
2   42    Male  101.0  Mild
3   31  Female   98.0  Mild
4   65  Female  101.0  Mild

In [22]:
top_left_corner_df

   age  gender  fever cough
0   60    Male  103.0  Mild
1   27    Male  100.0  Mild
2   42    Male  101.0  Mild
3   31  Female   98.0  Mild
4   65  Female  101.0  Mild

In [23]:
s=df.axes
s

[RangeIndex(start=0, stop=100, step=1),
 Index(['age', 'gender', 'fever', 'cough', 'city', 'has_covid'], dtype='object')]

In [26]:
p=df.dtypes
p

age            int64
gender        object
fever        float64
cough         object
city          object
has_covid     object
dtype: object

In [29]:
b=df.empty   ######################################################
b

False

In [30]:
df.ndim

2

In [31]:
df.shape

(100, 6)

In [32]:
df.size

600

In [33]:
a=df.values
a

array([[60, 'Male', 103.0, 'Mild', 'Kolkata', 'No'],
       [27, 'Male', 100.0, 'Mild', 'Delhi', 'Yes'],
       [42, 'Male', 101.0, 'Mild', 'Delhi', 'No'],
       [31, 'Female', 98.0, 'Mild', 'Kolkata', 'No'],
       [65, 'Female', 101.0, 'Mild', 'Mumbai', 'No'],
       [84, 'Female', nan, 'Mild', 'Bangalore', 'Yes'],
       [14, 'Male', 101.0, 'Strong', 'Bangalore', 'No'],
       [20, 'Female', nan, 'Strong', 'Mumbai', 'Yes'],
       [19, 'Female', 100.0, 'Strong', 'Bangalore', 'No'],
       [64, 'Female', 101.0, 'Mild', 'Delhi', 'No'],
       [75, 'Female', nan, 'Mild', 'Delhi', 'No'],
       [65, 'Female', 98.0, 'Mild', 'Mumbai', 'Yes'],
       [25, 'Female', 99.0, 'Strong', 'Kolkata', 'No'],
       [64, 'Male', 102.0, 'Mild', 'Bangalore', 'Yes'],
       [51, 'Male', 104.0, 'Mild', 'Bangalore', 'No'],
       [70, 'Male', 103.0, 'Strong', 'Kolkata', 'Yes'],
       [69, 'Female', 103.0, 'Mild', 'Kolkata', 'Yes'],
       [40, 'Female', 98.0, 'Strong', 'Delhi', 'No'],
       [64, 'Female', 98.0, 'Mild', 'Bangalore', 'Yes'],
       [42, 'Female', nan, 'Strong', 'Bangalore', 'Yes'],
       [12, 'Male', 98.0, 'Strong', 'Bangalore', 'No'],
       [73, 'Male', 98.0, 'Mild', 'Bangalore', 'Yes'],
       [71, 'Female', 98.0, 'Strong', 'Kolkata', 'Yes'],
       [80, 'Female', 98.0, 'Mild', 'Delhi', 'Yes'],
       [13, 'Female', 100.0, 'Strong', 'Kolkata', 'No'],
       [23, 'Male', nan, 'Mild', 'Mumbai', 'No'],
       [19, 'Female', 100.0, 'Mild', 'Kolkata', 'Yes'],
       [33, 'Female', 102.0, 'Strong', 'Delhi', 'No'],
       [16, 'Male', 104.0, 'Mild', 'Kolkata', 'No'],
       [34, 'Female', nan, 'Strong', 'Mumbai', 'Yes'],
       [15, 'Male', 101.0, 'Mild', 'Delhi', 'Yes'],
       [83, 'Male', 103.0, 'Mild', 'Kolkata', 'No'],
       [34, 'Female', 101.0, 'Strong', 'Delhi', 'Yes'],
       [26, 'Female', 98.0, 'Mild', 'Kolkata', 'No'],
       [74, 'Male', 102.0, 'Mild', 'Mumbai', 'Yes'],
       [82, 'Female', 102.0, 'Strong', 'Bangalore', 'No'],
       [38, 'Female', 101.0, 'Mild', 'Bangalore', 'No'],
       [55, 'Male', 100.0, 'Mild', 'Kolkata', 'No'],
       [49, 'Female', 101.0, 'Mild', 'Delhi', 'Yes'],
       [50, 'Female', 103.0, 'Mild', 'Kolkata', 'No'],
       [49, 'Female', 102.0, 'Mild', 'Delhi', 'No'],
       [82, 'Male', nan, 'Mild', 'Kolkata', 'Yes'],
       [27, 'Male', 100.0, 'Mild', 'Delhi', 'Yes'],
       [22, 'Female', 99.0, 'Mild', 'Bangalore', 'Yes'],
       [20, 'Male', 102.0, 'Strong', 'Delhi', 'No'],
       [72, 'Male', 99.0, 'Mild', 'Bangalore', 'No'],
       [19, 'Female', 101.0, 'Mild', 'Mumbai', 'No'],
       [18, 'Female', 104.0, 'Mild', 'Bangalore', 'No'],
       [66, 'Male', 99.0, 'Strong', 'Bangalore', 'No'],
       [44, 'Male', 104.0, 'Mild', 'Mumbai', 'No'],
       [19, 'Male', 101.0, 'Mild', 'Delhi', 'Yes'],
       [11, 'Female', 100.0, 'Strong', 'Kolkata', 'Yes'],
       [47, 'Female', 100.0, 'Strong', 'Bangalore', 'Yes'],
       [83, 'Male', 98.0, 'Mild', 'Delhi', 'Yes'],
       [60, 'Female', 99.0, 'Mild', 'Mumbai', 'Yes'],
       [81, 'Female', 101.0, 'Mild', 'Mumbai', 'Yes'],
       [71, 'Male', nan, 'Strong', 'Kolkata', 'No'],
       [49, 'Female', 99.0, 'Strong', 'Bangalore', 'No'],
       [23, 'Male', 98.0, 'Strong', 'Mumbai', 'Yes'],
       [6, 'Female', 104.0, 'Mild', 'Kolkata', 'Yes'],
       [24, 'Female', 102.0, 'Strong', 'Bangalore', 'Yes'],
       [81, 'Female', 98.0, 'Strong', 'Mumbai', 'No'],
       [56, 'Female', 104.0, 'Strong', 'Bangalore', 'Yes'],
       [10, 'Male', 100.0, 'Mild', 'Bangalore', 'No'],
       [42, 'Male', 104.0, 'Mild', 'Mumbai', 'No'],
       [69, 'Female', 102.0, 'Mild', 'Bangalore', 'No'],
       [51, 'Male', 104.0, 'Mild', 'Kolkata', 'No'],
       [65, 'Male', 99.0, 'Mild', 'Bangalore', 'No'],
       [54, 'Female', 104.0, 'Strong', 'Kolkata', 'No'],
       [73, 'Female', 103.0, 'Mild', 'Delhi', 'No'],
       [68, 'Female', 101.0, 'Strong', 'Delhi', 'No'],
       [75, 'Female', 104.0, 'Strong', 'Delhi', 'No'],
       [83, 'Female', 101.0, 'Mild', 'Kolkata', 'No'],
       [34, 'Male', 98.0, 'Strong', 'Kolkata', 'Yes'],
       [34, 'Female', 104.0, 'Strong', 'Delhi', 'No'],
       [5, 'Male', 102.0, 'Mild', 'Kolkata', 'Yes'],
       [80, 'Male', 100.0, 'Mild', 'Bangalore', 'Yes'],
       [8, 'Female', 101.0, 'Mild', 'Kolkata', 'No'],
       [11, 'Male', 100.0, 'Mild', 'Bangalore', 'Yes'],
       [48, 'Female', 103.0, 'Mild', 'Kolkata', 'Yes'],
       [14, 'Female', 99.0, 'Mild', 'Mumbai', 'Yes'],
       [65, 'Male', 99.0, 'Mild', 'Delhi', 'No'],
       [24, 'Male', 98.0, 'Mild', 'Kolkata', 'Yes'],
       [17, 'Female', 104.0, 'Mild', 'Kolkata', 'No'],
       [69, 'Female', 98.0, 'Strong', 'Mumbai', 'No'],
       [16, 'Female', 103.0, 'Mild', 'Bangalore', 'Yes'],
       [25, 'Male', 104.0, 'Mild', 'Bangalore', 'Yes'],
       [47, 'Male', 101.0, 'Strong', 'Bangalore', 'No'],
       [5, 'Female', 100.0, 'Mild', 'Kolkata', 'No'],
       [46, 'Male', 103.0, 'Strong', 'Bangalore', 'No'],
       [59, 'Female', 99.0, 'Strong', 'Delhi', 'No'],
       [38, 'Male', nan, 'Mild', 'Delhi', 'Yes'],
       [82, 'Female', 102.0, 'Strong', 'Kolkata', 'No'],
       [27, 'Male', 100.0, 'Mild', 'Kolkata', 'Yes'],
       [79, 'Male', nan, 'Strong', 'Kolkata', 'Yes'],
       [12, 'Female', 104.0, 'Mild', 'Bangalore', 'No'],
       [51, 'Female', 101.0, 'Strong', 'Kolkata', 'Yes'],
       [20, 'Female', 101.0, 'Mild', 'Bangalore', 'No'],
       [5, 'Female', 98.0, 'Strong', 'Mumbai', 'No'],
       [10, 'Female', 98.0, 'Strong', 'Kolkata', 'Yes']], dtype=object)

In [37]:
df=df.copy()

AttributeError: 'function' object has no attribute 'copy'

In [38]:
df=df.rank()

AttributeError: 'function' object has no attribute 'rank'

In [40]:
df=pd.read_csv("C:\\Users\\ASUS\\OneDrive\\Desktop\\pandas\\placement.csv")

In [44]:
df.dtypes

cgpa            float64
resume_score    float64
placed            int64
dtype: object

In [45]:
df=df.copy()

AttributeError: 'DataFrame' object has no attribute 'atypes'

In [42]:
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [46]:
df=df.read()

AttributeError: 'DataFrame' object has no attribute 'read'

In [49]:
p=df.sort_values(by='cgpa')
p

    cgpa  resume_score  placed
79  5.27          7.28       0
6   5.34          7.09       0
92  5.43          6.18       0
11  5.44          6.54       0
49  5.46          6.73       0
..   ...           ...     ...
34  8.87          7.19       1
15  8.88          5.93       1
37  9.05          8.21       1
93  9.31          7.39       1
76  9.40          5.50       1

[100 rows x 3 columns]

In [50]:
q = df.sort_values(by = ['cgpa' , 'resume_score'])
q

    cgpa  resume_score  placed
79  5.27          7.28       0
6   5.34          7.09       0
92  5.43          6.18       0
11  5.44          6.54       0
49  5.46          6.73       0
..   ...           ...     ...
34  8.87          7.19       1
15  8.88          5.93       1
37  9.05          8.21       1
93  9.31          7.39       1
76  9.40          5.50       1

[100 rows x 3 columns]

In [55]:
r=df.sort_index()
r

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [56]:
x = df.astype(int)        # type conversion 
x

    cgpa  resume_score  placed
0      8             6       1
1      6             5       0
2      8             8       1
3      6             7       1
4      7             7       1
..   ...           ...     ...
95     6             6       0
96     8             7       1
97     6             7       0
98     8             5       1
99     6             6       0

[100 rows x 3 columns]

In [58]:
s = df.abs() 
s

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [61]:
t=df.add(5)
t

     cgpa  resume_score  placed
0   13.14         11.52       6
1   11.17         10.17       5
2   13.27         13.86       6
3   11.88         12.27       6
4   12.52         12.30       6
..    ...           ...     ...
95  11.33         11.38       5
96  13.23         12.76       6
97  11.65         12.78       5
98  13.14         10.63       6
99  11.09         11.61       5

[100 rows x 3 columns]

In [62]:
s=df.count()
s

cgpa            100
resume_score    100
placed          100
dtype: int64

In [63]:
p=df.max()
p

cgpa            9.40
resume_score    9.06
placed          1.00
dtype: float64

In [64]:
q=df.min()
q

cgpa            5.27
resume_score    4.95
placed          0.00
dtype: float64

In [65]:
r=df.mean()
r

cgpa            6.9422
resume_score    6.9305
placed          0.5000
dtype: float64

In [67]:
s=df.median()
s

cgpa            6.620
resume_score    7.055
placed          0.500
dtype: float64

In [68]:
s=df.sum()
s

cgpa            694.22
resume_score    693.05
placed           50.00
dtype: float64

In [71]:
g = df.filter(items = ['cgpa' , 'placed'])
g

    cgpa  placed
0   8.14       1
1   6.17       0
2   8.27       1
3   6.88       1
4   7.52       1
..   ...     ...
95  6.33       0
96  8.23       1
97  6.65       0
98  8.14       1
99  6.09       0

[100 rows x 2 columns]

In [76]:
s = df.filter(items = [5,10] , axis = 0)
s

    cgpa  resume_score  placed
5   8.77          6.19       1
10  6.18          6.35       0

In [81]:
t = df.filter(like = '5' , axis = 0)
t

    cgpa  resume_score  placed
5   8.77          6.19       1
15  8.88          5.93       1
25  7.76          5.68       1
35  8.07          7.48       1
45  8.10          5.44       1
50  8.22          6.74       1
51  6.54          7.39       0
52  5.90          7.50       0
53  6.00          7.16       0
54  5.92          7.18       0
55  6.94          6.87       1
56  6.13          6.43       0
57  6.34          7.21       0
58  6.47          7.37       0
59  5.95          7.57       0
65  6.04          8.75       0
75  6.34          7.94       1
85  6.72          5.46       0
95  6.33          6.38       0

In [82]:
s = df.to_dict()    # save in dictionary

In [83]:
q = df.to_string()    # save in string

In [86]:
indx=df.columns

In [90]:
label = df.columns[0]  # first column label 
label

'cgpa'

In [88]:
p = df.columns.tolist()    # list of column labels 
p

['cgpa', 'resume_score', 'placed']

In [91]:
q = df.columns.values    # array of column labels
q

array(['cgpa', 'resume_score', 'placed'], dtype=object)

In [93]:
p=df.rename(columns = {"cgpa": "half year marks" , "resume_score":"semester masks"})     # How to rename a column
p

    half year marks  semester masks  placed
0              8.14            6.52       1
1              6.17            5.17       0
2              8.27            8.86       1
3              6.88            7.27       1
4              7.52            7.30       1
..              ...             ...     ...
95             6.33            6.38       0
96             8.23            7.76       1
97             6.65            7.78       0
98             8.14            5.63       1
99             6.09            6.61       0

[100 rows x 3 columns]

In [94]:
s =p.columns = ['cgpa' , 'resume_score' , 'placed']
s

['cgpa', 'resume_score', 'placed']

In [95]:
df['half'] = df['cgpa'].where(df['cgpa']>50 , other = 0)
df.head(3)

   cgpa  resume_score  placed  half
0  8.14          6.52       1   0.0
1  6.17          5.17       0   0.0
2  8.27          8.86       1   0.0